Revit 2024 API
BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToElbow Property
 Failed to downgrade tee type to elbow type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedDowngradeCrossToElbow { get; }
Visual Basic
Public Shared ReadOnly Property FailedDowngradeCrossToElbow As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedDowngradeCrossToElbow {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace